export const useMock = () => {
  const allCarts = [
    {
      id: 13242314,
      title: 'Lexus LX: 2008 г., 5.7 л, Автомат, Бензиновая, Внедорожник',
      description: 'Основные характеристики и детали по фото: - Кузов: полноразмерный SUV, черный металлик, оригинальный фирменный обвес, хромированная решетка радиатора Lexus, рейлинги на крыше, подножки. - Оптика: биксенон/LED фары с омывателями, противотуманные фары в переднем бампере. - Колеса: легкосплавные диски темного цвета, всесезонные шины. - Салон: бежняя перфорированная кожа, второй ряд с капитанскими креслами и широким центральным подлокотником/консолью, черные защитные чехлы на передних спинках, фирменные коврики, отдельные воздуховоды и блок управления климатом для задних пассажиров. - Оснащение и удобства: мультируль, электрорегулировки сидений, подогревы, много-зонный климат-контроль, тонировка, камера/датчики (по наличию на бампере), электропривод стекол и зеркал. - Экстерьерные элементы: повторители поворота в зеркалах, хром-молдинги, спойлер, антенна-плавник. - Полный привод, высокий дорожный просвет, мощный V8 (характерно для LX 570). Автомобиль с кыргызскими номерами (KG, регион 05) по фото. Стильный черный цвет, богатая комплектация, просторный комфортный салон для дальних поездок и города.',
      category: 'transport',
      previewImage: {
        src: '/lexus_1.jpeg',
      },
      images: [
        {
          src: '/lexus_2.jpeg',
        },
        {
          src: '/lexus_3.jpeg',
        },
        {
          src: '/lexus_4.jpeg',
        },
        {
          src: '/lexus_5.jpeg',
        },
        {
          src: '/lexus_6.jpeg',
        },
        {
          src: '/lexus_7.jpeg',
        },
      ],
    },
    {
      id: 1314,
      title: 'LexMercedes-Benz G-Class: 2022 г., 4 л, Автомат, Бензиновая, Внедорожник',
      description: 'Машина в наличии в Бишкеке🇰🇬 90 пробег 2022 год G$ Без вложений Без ДТП',
      category: 'transport',
      previewImage: {
        src: '/gle_1.webp',
      },
      images: [
        {
          src: '/gle_2.jpeg',
        },
        {
          src: '/gle_3.jpeg',
        },
        {
          src: '/gle_4.jpeg',
        },
        {
          src: '/gle_5.jpeg',
        },
        {
          src: '/gle_6.jpeg',
        },
        {
          src: '/gle_7.jpeg',
        },
      ],
    },
    {
      id: 133423414,
      title: 'Лофт с проектором — Руставели',
      description: 'Историческая стильная квартира с проектором в спальне, уютным балконом и неоновыми огнями:) Он расположен в 200-летнем здании культурного наследия, которое расположено в исторической части города, рядом с Тбилисской государственной консерваторией (по вечерам вы можете услышать живую музыку, сидя на балконе). В этом районе есть целые театры, музеи, пабы, рестораны и магазины. В нескольких минутах ходьбы от проспекта Руставели и площади Свободы, автобусной остановки/от аэропорта, двух станций метро.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/tbilisi_1.avif',
      },
      images: [
        {
          src: '/tbilisi_2.avif',
        },
        {
          src: '/tbilisi_3.avif',
        },
        {
          src: '/tbilisi_4.avif',
        },
        {
          src: '/tbilisi_5.avif',
        },
        {
          src: '/tbilisi_6.avif',
        },
        {
          src: '/tbilisi_7.avif',
        },
      ],
    },
    {
      id: 1983241414,
      title: 'Гостевые апартаменты в центре Бишопскорта',
      description: 'Светлая и солнечная. Расположена в центре города, недалеко от центра города, садов Кирстенбош, Хаут-Бэй и False Bay. Рядом с UCT, школами и торговыми центрами. Отдельная квартира с 1 спальней на первом этаже в большом доме. Ванная комната с мини-кухней, оснащенной микроволновой печью, индукционной плитой и аэрофритюрницей. В комнате есть 2 кресла, а также небольшой стол с 2 стульями для обеда или работы. На общей площадке есть 2 кресла, рабочий стол и доступ к общей террасе. Жилье Хозяин живет в главном доме, расположенном рядом с частной квартирой. Вход и посадка являются общими с другой квартирой. Что доступно гостю Бассейн и теннисный корт будут доступны для использования Важная информация У меня 3 собаки и 2 кошки, которые дружелюбны. Я работаю из дома, поэтому всегда готов ответить на вопросы.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bish_1.avif',
      },
      images: [
        {
          src: '/bish_2.avif',
        },
        {
          src: '/bish_3.avif',
        },
        {
          src: '/bish_4.avif',
        },
        {
          src: '/bish_5.avif',
        },
        {
          src: '/bish_6.avif',
        },
        {
          src: '/bish_7.avif',
        },
        {
          src: '/bish_8.avif',
        },
        {
          src: '/bish_9.avif',
        },
      ],
    },
    {
      id: 1241414,
      title: 'Элитные аппартаменты квартиры в бишкеке',
      description: 'Элитные аппартаменты квартиры в бишкеке — это апартаменты, расположенные в городе Akchiy. Гостям доступен бесплатный Wi-Fi на всей территории. В этих апартаментах с кондиционером и выходом на балкон есть спальня (1) и полностью оборудованная кухня. Среди удобств — телевизор с плоским экраном.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bishkek_1.jpg',
      },
      images: [
        {
          src: '/bishkek_2.jpg',
        },
        {
          src: '/bishkek_3.jpg',
        },
        {
          src: '/bishkek_4.jpg',
        },
        {
          src: '/bishkek_5.jpg',
        },
        {
          src: '/bishkek_6.jpg',
        },
        {
          src: '/bishkek_7.jpg',
        },
      ],
    },
    {
      id: 133423414,
      title: 'Лофт с проектором — Руставели',
      description: 'Историческая стильная квартира с проектором в спальне, уютным балконом и неоновыми огнями:) Он расположен в 200-летнем здании культурного наследия, которое расположено в исторической части города, рядом с Тбилисской государственной консерваторией (по вечерам вы можете услышать живую музыку, сидя на балконе). В этом районе есть целые театры, музеи, пабы, рестораны и магазины. В нескольких минутах ходьбы от проспекта Руставели и площади Свободы, автобусной остановки/от аэропорта, двух станций метро.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/tbilisi_1.avif',
      },
      images: [
        {
          src: '/tbilisi_2.avif',
        },
        {
          src: '/tbilisi_3.avif',
        },
        {
          src: '/tbilisi_4.avif',
        },
        {
          src: '/tbilisi_5.avif',
        },
        {
          src: '/tbilisi_6.avif',
        },
        {
          src: '/tbilisi_7.avif',
        },
      ],
    },
    {
      id: 1983241414,
      title: 'Гостевые апартаменты в центре Бишопскорта',
      description: 'Светлая и солнечная. Расположена в центре города, недалеко от центра города, садов Кирстенбош, Хаут-Бэй и False Bay. Рядом с UCT, школами и торговыми центрами. Отдельная квартира с 1 спальней на первом этаже в большом доме. Ванная комната с мини-кухней, оснащенной микроволновой печью, индукционной плитой и аэрофритюрницей. В комнате есть 2 кресла, а также небольшой стол с 2 стульями для обеда или работы. На общей площадке есть 2 кресла, рабочий стол и доступ к общей террасе. Жилье Хозяин живет в главном доме, расположенном рядом с частной квартирой. Вход и посадка являются общими с другой квартирой. Что доступно гостю Бассейн и теннисный корт будут доступны для использования Важная информация У меня 3 собаки и 2 кошки, которые дружелюбны. Я работаю из дома, поэтому всегда готов ответить на вопросы.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bish_1.avif',
      },
      images: [
        {
          src: '/bish_2.avif',
        },
        {
          src: '/bish_3.avif',
        },
        {
          src: '/bish_4.avif',
        },
        {
          src: '/bish_5.avif',
        },
        {
          src: '/bish_6.avif',
        },
        {
          src: '/bish_7.avif',
        },
        {
          src: '/bish_8.avif',
        },
        {
          src: '/bish_9.avif',
        },
      ],
    },
    {
      id: 1241414,
      title: 'Элитные аппартаменты квартиры в бишкеке',
      description: 'Элитные аппартаменты квартиры в бишкеке — это апартаменты, расположенные в городе Akchiy. Гостям доступен бесплатный Wi-Fi на всей территории. В этих апартаментах с кондиционером и выходом на балкон есть спальня (1) и полностью оборудованная кухня. Среди удобств — телевизор с плоским экраном.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bishkek_1.jpg',
      },
      images: [
        {
          src: '/bishkek_2.jpg',
        },
        {
          src: '/bishkek_3.jpg',
        },
        {
          src: '/bishkek_4.jpg',
        },
        {
          src: '/bishkek_5.jpg',
        },
        {
          src: '/bishkek_6.jpg',
        },
        {
          src: '/bishkek_7.jpg',
        },
      ],
    },
    {
      id: 133423414,
      title: 'Лофт с проектором — Руставели',
      description: 'Историческая стильная квартира с проектором в спальне, уютным балконом и неоновыми огнями:) Он расположен в 200-летнем здании культурного наследия, которое расположено в исторической части города, рядом с Тбилисской государственной консерваторией (по вечерам вы можете услышать живую музыку, сидя на балконе). В этом районе есть целые театры, музеи, пабы, рестораны и магазины. В нескольких минутах ходьбы от проспекта Руставели и площади Свободы, автобусной остановки/от аэропорта, двух станций метро.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/tbilisi_1.avif',
      },
      images: [
        {
          src: '/tbilisi_2.avif',
        },
        {
          src: '/tbilisi_3.avif',
        },
        {
          src: '/tbilisi_4.avif',
        },
        {
          src: '/tbilisi_5.avif',
        },
        {
          src: '/tbilisi_6.avif',
        },
        {
          src: '/tbilisi_7.avif',
        },
      ],
    },
    {
      id: 1983241414,
      title: 'Гостевые апартаменты в центре Бишопскорта',
      description: 'Светлая и солнечная. Расположена в центре города, недалеко от центра города, садов Кирстенбош, Хаут-Бэй и False Bay. Рядом с UCT, школами и торговыми центрами. Отдельная квартира с 1 спальней на первом этаже в большом доме. Ванная комната с мини-кухней, оснащенной микроволновой печью, индукционной плитой и аэрофритюрницей. В комнате есть 2 кресла, а также небольшой стол с 2 стульями для обеда или работы. На общей площадке есть 2 кресла, рабочий стол и доступ к общей террасе. Жилье Хозяин живет в главном доме, расположенном рядом с частной квартирой. Вход и посадка являются общими с другой квартирой. Что доступно гостю Бассейн и теннисный корт будут доступны для использования Важная информация У меня 3 собаки и 2 кошки, которые дружелюбны. Я работаю из дома, поэтому всегда готов ответить на вопросы.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bish_1.avif',
      },
      images: [
        {
          src: '/bish_2.avif',
        },
        {
          src: '/bish_3.avif',
        },
        {
          src: '/bish_4.avif',
        },
        {
          src: '/bish_5.avif',
        },
        {
          src: '/bish_6.avif',
        },
        {
          src: '/bish_7.avif',
        },
        {
          src: '/bish_8.avif',
        },
        {
          src: '/bish_9.avif',
        },
      ],
    },
    {
      id: 1241414,
      title: 'Элитные аппартаменты квартиры в бишкеке',
      description: 'Элитные аппартаменты квартиры в бишкеке — это апартаменты, расположенные в городе Akchiy. Гостям доступен бесплатный Wi-Fi на всей территории. В этих апартаментах с кондиционером и выходом на балкон есть спальня (1) и полностью оборудованная кухня. Среди удобств — телевизор с плоским экраном.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bishkek_1.jpg',
      },
      images: [
        {
          src: '/bishkek_2.jpg',
        },
        {
          src: '/bishkek_3.jpg',
        },
        {
          src: '/bishkek_4.jpg',
        },
        {
          src: '/bishkek_5.jpg',
        },
        {
          src: '/bishkek_6.jpg',
        },
        {
          src: '/bishkek_7.jpg',
        },
      ],
    },
    {
      id: 133423414,
      title: 'Лофт с проектором — Руставели',
      description: 'Историческая стильная квартира с проектором в спальне, уютным балконом и неоновыми огнями:) Он расположен в 200-летнем здании культурного наследия, которое расположено в исторической части города, рядом с Тбилисской государственной консерваторией (по вечерам вы можете услышать живую музыку, сидя на балконе). В этом районе есть целые театры, музеи, пабы, рестораны и магазины. В нескольких минутах ходьбы от проспекта Руставели и площади Свободы, автобусной остановки/от аэропорта, двух станций метро.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/tbilisi_1.avif',
      },
      images: [
        {
          src: '/tbilisi_2.avif',
        },
        {
          src: '/tbilisi_3.avif',
        },
        {
          src: '/tbilisi_4.avif',
        },
        {
          src: '/tbilisi_5.avif',
        },
        {
          src: '/tbilisi_6.avif',
        },
        {
          src: '/tbilisi_7.avif',
        },
      ],
    },
    {
      id: 1983241414,
      title: 'Гостевые апартаменты в центре Бишопскорта',
      description: 'Светлая и солнечная. Расположена в центре города, недалеко от центра города, садов Кирстенбош, Хаут-Бэй и False Bay. Рядом с UCT, школами и торговыми центрами. Отдельная квартира с 1 спальней на первом этаже в большом доме. Ванная комната с мини-кухней, оснащенной микроволновой печью, индукционной плитой и аэрофритюрницей. В комнате есть 2 кресла, а также небольшой стол с 2 стульями для обеда или работы. На общей площадке есть 2 кресла, рабочий стол и доступ к общей террасе. Жилье Хозяин живет в главном доме, расположенном рядом с частной квартирой. Вход и посадка являются общими с другой квартирой. Что доступно гостю Бассейн и теннисный корт будут доступны для использования Важная информация У меня 3 собаки и 2 кошки, которые дружелюбны. Я работаю из дома, поэтому всегда готов ответить на вопросы.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bish_1.avif',
      },
      images: [
        {
          src: '/bish_2.avif',
        },
        {
          src: '/bish_3.avif',
        },
        {
          src: '/bish_4.avif',
        },
        {
          src: '/bish_5.avif',
        },
        {
          src: '/bish_6.avif',
        },
        {
          src: '/bish_7.avif',
        },
        {
          src: '/bish_8.avif',
        },
        {
          src: '/bish_9.avif',
        },
      ],
    },
    {
      id: 1241414,
      title: 'Элитные аппартаменты квартиры в бишкеке',
      description: 'Элитные аппартаменты квартиры в бишкеке — это апартаменты, расположенные в городе Akchiy. Гостям доступен бесплатный Wi-Fi на всей территории. В этих апартаментах с кондиционером и выходом на балкон есть спальня (1) и полностью оборудованная кухня. Среди удобств — телевизор с плоским экраном.',
      category: 'nedvizhimost',
      coordinates: [44.770495496222274, 41.716244387476706],
      address: 'Грузия, Тбилиси улица пушкина дом калатушкина квартира 10',
      previewImage: {
        src: '/bishkek_1.jpg',
      },
      images: [
        {
          src: '/bishkek_2.jpg',
        },
        {
          src: '/bishkek_3.jpg',
        },
        {
          src: '/bishkek_4.jpg',
        },
        {
          src: '/bishkek_5.jpg',
        },
        {
          src: '/bishkek_6.jpg',
        },
        {
          src: '/bishkek_7.jpg',
        },
      ],
    },
  ]

  const cartById = (id?: string) =>
    allCarts.find(cart => cart.id.toString() === id?.toString())

  const cartByCategory = (category?: string) =>
    allCarts.filter(cart => cart.category === category)

  return {
    allCarts,
    cartById,
    cartByCategory,
  }
}
